//=============================================================================
//  CSVファイル読み込み
//　作成日：2015/9/1
//　更新日：2016/10/30
//	制作者：佐々木隆貴
//=============================================================================
#include "readFile.h"
#include <Windows.h>

readFile::readFile()
{
	data = nullptr;
}

//=============================================================================
//  CSVファイル読み込み
//　引数：ファイル名
//	戻り値：読み込み成功かどうか
//=============================================================================
bool readFile::read(char* fileName)
{
	//ファイルを開く
	HANDLE hFile;
	hFile = CreateFile(
		fileName,				//ファイル名
		GENERIC_READ,			//アクセスモード（読み込み用）
		0,						//共有（なし）
		NULL,					//セキュリティ属性
		OPEN_EXISTING,			//開く方法（ファイルがなければ失敗）
		FILE_ATTRIBUTE_NORMAL,	//属性とフラグ（設定なし）
		NULL);					//拡張属性なし

	//開けなかったら中断
	if(hFile == NULL) return false;

	//ファイルのサイズを取得
	DWORD fileSize = GetFileSize(hFile, NULL);

	//ファイルのサイズ分メモリを確保
	data = new char[fileSize];

	//全部読み込む
	DWORD dwBytes = 0;		//読み込み位置
	ReadFile(
		hFile,				//ファイルハンドル
		data,				//データを入れる変数
		fileSize,			//読み込むサイズ
		&dwBytes,			//読み込んだサイズ（読み込み位置）
		NULL);				//オーバーラップド構造体（今回は使わない）

	//ファイルを閉じる
	CloseHandle(hFile);

	return true;

}

//=============================================================================
//  コンマ区切りで情報を取得
//　引数：ファイルデータ、要素番号の添字
//	戻り値：読み込まれた情報
//=============================================================================
int readFile::getToComma(int* index)
{
	char chr[256];
	int i=0;

	//「,」まで１文字ずつchrにいれる
	while(data[*index] != ',' && data[*index] != '\n')
	{
		chr[i] = data[*index];		//ここでモノの種類を表す番号がchr[i]にはいる
		i++;
		(*index)++;
	}

	//最後に「\0」をつける
	chr[i] = '\0';
	i++;
	(*index)++;

	//整数に変換
	int value;
	value = atoi(chr);

	return value;
}

//=============================================================================
//  data配列削除
//　引数：なし
//	戻り値：なし
//=============================================================================
void readFile::deleteDataArray()
{
	delete[] data;
}